ci4/app/Controllers/Artikel.php

SELECT *
FROM `artikel`
WHERE `slug` = 'Artikel-Ketiga'
 LIMIT 1
---
  public function view($slug)
  {
    $model = new ArtikelModel();
    $artikel = $model->where(['slug' => $slug])->first();

INSERT INTO `artikel` (`judul`, `isi`, `slug`) VALUES ('Artikel Ketiga', 'Ini adalah artikel ketiga dari matakuliah Web Programing pratikum 12 yang', 'Artikel-Ketiga')
---
  public function add()
  {
    // Validasi data
    $validation = \Config\Services::validation();
    $validation->setRules(['judul' => 'required']);
    $isDataValid = $validation->withRequest($this->request)->run();

    if ($isDataValid) {
      $artikel = new ArtikelModel();
      $artikel->insert([
        'judul' => $this->request->getPost('judul'),
        'isi' => $this->request->getPost('isi'),
        'slug' => url_title($this->request->getPost('judul')),
      ]);

SELECT *
FROM `artikel`
WHERE `id` = '5'
 LIMIT 1
---
  public function edit($id)
  {
    $artikel = new ArtikelModel();

    $validation = \Config\Services::validation();
    $validation->setRules(['judul' => 'required']);
    $isDataValid = $validation->withRequest($this->request)->run();

    if ($isDataValid) {
      $artikel->update(
        $id,
        [
          'judul' => $this->request->getPost('judul'),
          'isi' => $this->request->getPost('isi'),
        ]
      );
      return redirect('admin/artikel');
    }
    $data = $artikel->where('id', $id)->first();

DELETE FROM `artikel`
WHERE `id` IN ('12')
---
  public function delete($id)
  {
    $artikel = new ArtikelModel();
    $artikel->delete($id);